{
    "produtos": [{
        "id": "cd31e137-c78c-4fec-a868-d8780bb96b56",
        "nome": "Console Microsoft Xbox Series S, 512GB, Branco",
        "descricao": "Xbox Series S, o menor e mais elegante de todos os tempos. Com taxas de quadros mais altas, tempos de carregamento mais rápidos e mundos mais ricos e dinâmicos, o Xbox Series S oferece desempenho e velocidade de última geração em um formato compacto e totalmente digital.",
        "imagem": "https://images.kabum.com.br/produtos/fotos/128561/console-microsoft-xbox-series-s-500gb-branco-rrs-00006_1601067301_gg.jpg",
        "preco": "2249.90",
        "ativo": true
    }, {
        "nome": "SSD Kingston A400, 120GB, SATA",
        "imagem": "https://images.kabum.com.br/produtos/fotos/85196/85196_index_gg.jpg",
        "preco": "149",
        "ativo": true,
        "descricao": "SSD Kingston A400, 120GB, SATA, Leitura 500MB/s, Gravação 350MB/s\r\n \r\n\r\nSSD Kingston A400 é o mais confiável e durável do que um disco rígido\r\nA unidade de estado sólido A400 da Kingston aumenta drasticamente a resposta do seu computador com tempos incríveis de inicialização, carregamento e transferência, comparados a discos rígidos mecânicos.\r\n\r\n \r\n\r\nMais velocidade para o seu PC com A400\r\nReforçado com uma controladora de última geração para velocidades de leitura e gravação de até 500MB/s e 450MB/s, este SSD é 10x mais rápido do que um disco rígido tradicional para melhor desempenho, resposta ultrarrápida em multitarefas e um computador mais rápido de modo geral. Também mais confiável e durável do que um disco rígido, o A400 é feito com memória Flash.\r\n\r\n \r\n\r\nO SSD mais resistente\r\nO SSD Kingston A400, não existem partes móveis, com menor probabilidade de falhas do que um disco rígido mecânico. Também é mais frio e mais silencioso e sua resistência a choques e vibração torna-o ideal para notebooks e outros dispositivos móveis de computação.\r\n\r\n \r\n\r\nDiversas Capacidades do A400\r\nO A400 está disponível em diversas capacidades de 120GB oferecendo todo o espaço que você precisa para aplicativos, vídeos, fotos e outros documentos importantes. Você também pode substituir seu disco rígido ou um SSD menor por uma unidade grande o suficiente para conter todos os seus arquivos. SSD confiável e durável para melhor desempenho do computador e respostas ultrarrápidas em multitarefas.\r\n\r\n \r\n\r\nSSD Kingston A400 é mais rápido que um disco Rígido \r\nRápida inicialização, carregamento e transferência de arquivos; Mais confiável e mais durável do que um disco rígido; Diversas capacidades com espaço para aplicativos ou para substituição do disco rígido.",
        "id": "d7d1e66d-4440-4fce-a953-953e456b3848"
    }, {
        "id": "f58ce632-9bd7-45bc-9013-52ad1f04f0f2",
        "nome": "Monitor Gamer Ozone 24 LED, 240 Hz, Full HD, 1ms, FreeSync, HDMI/DisplayPort - OZDSP24FHD240",
        "imagem": "https://images.kabum.com.br/produtos/fotos/114412/monitor-gamer-led-ozone-24-full-hd-hdmi-displayport-240hz-1ms-ozdsp24fhd240_1608297380_gg.jpg",
        "preco": "1199.99",
        "ativo": true,
        "descricao": "Monitor Gamer Ozone 24 LED - Atualizado\r\n\r\nMonitor Gamer Ozone 24´ Jogos Confortáveis Um Monitor Gamer projetado ergonomicamente em materiais robustos e de qualidade, possui uma excelente estética, com quadros finos e modernos que atraem você e dimensões compactas que facilitam a configuração de vários monitores. Por outro lado, a sua base estável permite inclinar e rodar o monitor, adaptando-o ao ângulo ideal, bem como regular a sua altura sem dificuldades, regulando-o para uma melhor visualização e maior conforto.\r\n\r\nAlém disso, o DSP24 é compatível com o sistema de montagem VESA, permitindo que você o monte facilmente na parede, liberando a área de trabalho. Taxa de Atualização de 240Hz Entre no jogo com o monitor LED Ozone DSP24 240 de 24,5 polegadas com alta resolução de 1920 x 1080 pixels FULL HD, que garante a definição de que você precisa em todos os momentos. Para os jogadores mais exigentes e competitivos, sua taxa de atualização de 240 Hz permite uma reação rápida, graças às imagens perfeitas. Ozone DSP24 240 é um monitor que permite desfrutar da melhor experiência visual possível, jogando, trabalhando ou assistindo séries ou filmes, focando sua atenção no que realmente importa.\r\n\r\nLow Blue Light e Flicker Free Também não esquecendo o conforto dos olhos, com as tecnologias Low Blue Light e Flicker Free, que liberam a imagem da cintilação e oferecem proteção contra a luz azul, reduzindo a fadiga ocular durante jogos longos, e significa que você pode desfrutar de uma experiência de jogo completa na qual nada irá parar você. Entre no jogo com o monitor LED Ozone DSP24 de 24 polegadas com alta resolução de 1920 x 1080 pixels FULL HD, que garante a definição que você precisa o tempo todo."
    }],
    "usuarios": [{
        "id": "1",
        "nome": "admin",
        "email": "admin@mail.com",
        "senha": "jR0x7L0GSJipqy1vM8D59OehlGnCKFoAHhV8f4bbEiS",
        "logado": "false",
        "tipoUsuario": "admin"
    }, {
        "nome": "Wendel",
        "email": "wendel@mail.com",
        "senha": "$2a$10$jR0x7L0GSJipqy1vM8D59OehlGnCKFoAHhV8f4bbEiS.8bL746XNm",
        "id": "dc48b3bb-e8c7-445d-a7e3-f4a5527a19a3"
    }, {
        "nome": "Ian Moreira",
        "email": "ian@mail.com",
        "senha": "$2a$10$OlVh7kEB6CG1zHN05GmhmeII0816wdjmEHpdtsgwHZ8QS2py3v17a",
        "id": "bbc41182-2aaa-4cc2-9bfb-84d07571a076"
    }]
}